let me = {
  firstName: 'merabi',
  lastName: 'jiqidze',
  age: '20',
  city: 'kutaisi',
  hob: 'programing',
};

console.log(me.city); // გამოვიძახე ობიექტის სახელი შემდეგ წერტილი და იმ კუთვნილების სახელი რა მნიშვნელობაც მინდოდა გამომეტანა და გამოიტანა

// ობიექტი არის მასივის მსგავსი თუ ჩვენ მასივიდან ელემენტი გამოგვქონდა ინდექსის საშვალებით ობიექტში უკვე კუთვნილების საშვალებით გამოგვაქვს
// კუთვნილება მაგ: firstName: "მერაბი" მაგ ვქმნით კუთვნილებას და ვარქმევთ რას firstName მასში ვინახავთ მნიშვნელობას ჩემს სახელს ანუ firstName-ს კუთვნილება იქნება იქნება ჩემი სახელი რაც მე მასში შევინახე
// ობიექთტში გვქვს კუთვნილებები თუ ჩვენ გვინდა ობიექტიდან ნებისმიერ რამის გამოტანა რაც მასში გვაქვს დავწერთ კუთვნილების სახელს და ის ავტომატურად გამოიტანს მის მნიშვნელობას რაც კუთვნილებაშია შენახული

//

let cars = {
  bmw: 'F90',
  mercedes: 'CLS63',
  opel: 'astra',
  newCars: {
    lamborghini: 'urus',
    audi: 'RS8',
  },
};

delete cars.opel;
cars.porche = '911';

console.log(cars);

//

let user = parseInt(prompt('შეიყვანე შენი ასაკი'));

if (user > 0 && user <= 13) {
  alert('შენ არასრულ წლოვანიხარ');
} else if (user >= 13 && user < 18) {
  alert('შენ ხარ თინეიჯერი');
} else if (user >= 18) {
  alert('შენ ხარ სრულწლოვანი');
} else if (user <= 0) {
  alert('შენ არც კი დაბადებულხარ');
} else if (user !== Number) {
  alert('შეიყვანე მხოლოდ ასაკი!');
}
