import figlet from 'figlet';
import chalk from 'chalk';

figlet('M   E   R   A   B          J   I   Q   I   D   Z   E', (err, names) => {
  if (err) {
    console.log('Name is not defined!', err);
    return;
  }

  console.log(chalk.bgBlack.yellow.bold(`${names}`));
});

// npm (Node Package Manager) - ენპიემ არის ბიბლიოთეკების სამყარო, როდესაც ჩვენ ჩავიწერთ კომპიუტერში Node.js ის ავტომატურად მოჰყვება მას
// რაში გვეხმარება npm ის გვეხმარება რომ პროექტში რომარ მოგვიწიოს განახლებების გაკეთება ჩვენივე ხელით ბიბლიოთეკების ჩამოწერა ასევე შეგვიძლია ვმართოთ სხვადასხვა მოდულებზე ინფორმაცია

// package.json - არის ჩვენი პროქტის ინფორმაციების სია
// რაში ვიყენებთ ჩვენ მას არწერს ჩვენს პროექტის შესახებ ინფორმაციას მაგ: ვინ შექმნა პროქტი, რომელი ვერსია არის, რა მოდულებია დაინსტალირებული ჩვენს პროქტში და ასე შემდეგ.
// შეჯამება არღწერს ჩვენს პროექტს თუ ჩვენს პროქტს ვინმეს მივცემთ იქ დეტალურად ეწერება ყველაფერი

// package-lock.json -არის ფაილი სადაც ინახება ჩვენს მიერ ჩამოწერილი მოდულების შესახებ გვეუბნება ინფორმაციებს და კიდევ ის ჩამოწერილი მოდულები თუ იყენებს სხვა მოდულებს
// node_modules ინახავს თვითონ კოდს და ყველა იმ ბიბლიოთეკებს რაც ჩამოტვირთულები გვაქვს იქ ინახება მილიონობით კოდი.

// import/export and module.exports/require

// commonJs ესარის გზა Node.js ში რომელიც იყენებს ძველ მეთოდს module.exports/require
// module.exports - იმისათვის ვოყენებთ რომ ფაილიდან გავიტანოთ კოდი
// require - ვიყენებთ როდესაც ფაილში შემოტანა გვინდა რაიმე კოდის ან ფუნქციის ნებისმიერ რამის

// Es Modules (import/exports) ესარის თანამედროვე გზა იმპორტ ექსპორტზე სამუშაოდ მუშაობს ბრაუზერში და ასევე Node.js-ში
// export - როდესაც რაიმე გაგვაქვს ფაილიდან
// import - როდესაც ფაილში შეგვაქვს რაღაც
