import Child from './Child';
import Grandchild from './Grandchild';
import Parent from './Parent';

const App = () => {
  return (
    <>
      <Parent message='This is test props' />
    </>
  );
};

export default App;

// Props Drilling - არის როდესაც ინფორმაცია გვინდა გადავცეთ მშობელ კომპონენტიდან შვილობილ კონპონენტებს ამდროს ხდება შუამავლობა ერთი კომპონენტიდან მეირე კომპონენტზე ჯაჭვური გადაცემა
// მშობელი კომპონენტი გადაცემს მეორე კომპონენტს მეორე კომპონენტი მესამეს და შემდეგ მესამე კომპონენტი გამოიტანს მშობელი კომპონენტიდან გადაცემულ ინფორმაცია
// შუამავალი კომპონენტები შეიძლება არ იყენებდეს მშობელი კომპონენტიდან გადაცემულ ინფორმაციას მაგრამ შუამავლობა ხდება რომ საბოლოო შვილობილ კომპონენტამდე გადასაცემად
