let num = 1;

while (num <= 10) {
  console.log(num);
  num++;
}

// While loop - მაშინ ვიყენებთ როდესაც არ ვიცით თუ რამდენჯერ უნდა განმეორდეს პირობა მაგ: პაროლის ჩაწერის შემთხვევაში ჩვენ ხო არ ვიცით მომხრამებელი რამდენჯერ შეიყვანს არასწორ პაროლს იქამდე იმუშავებს პორობა სანამ არ იქნება False ბულიანზე მუშაობს
//  For loop - მაშინ ვიყენებთ როდესავ ვიცით განმეორების ან გაშვების რაოდენობა როდესაც ვიცით ზუსტად თუ რამდენჯერ უნდა განმეორდეს ან შესრულდეს პირობა გამოვიყენოთ For loop

// 2

let count = 0;

do {
  count++;
  console.log(count);
} while (count < 10);

// do while - ჯერ ის გაეშვება და შემდეგ გაეშვება While ის დასაწყისში ერთხელ მაინც გაუსვებს კოდს მაშინ ვიყენებთ როცა გვინდა ერთხელ მაინც გაეშვას რაიმე
// while loop - ჯერ პირობას ამოწმებს და შემდეგ გაუშვებს და თუ მას False გადაეცა შეწყვეტს მუშაობას ჯერ ამოწმებს შემდეგ უშვებს
