import { num1, nums2, nums3, nums4 } from './math.js'; // import საშვალებით შემოგვაქვს ამ ახალ ფაილში წინა ფაილში დაწერილი კოდი

// იმპორტს გადავცემთ იმ ფუქნქციების სახელებს რას წინა ფაილში შევქმენით შემდეგ ვეუბნებით თუ რომელ ფაილიდან შემოგვაქვს from-სან საიდან და მაგ: "./math.js"

// ქონსოლ ლოგის საშვალებით გადავეცით იმ შენახულ ფუნქციებს მნიშვნელობები
console.log(num1(2, 2));
console.log(num1(10, 2));
console.log(num1(20, 4));
console.log(num1(10, 5));

// 2

// import არის შემოტანა სხვა ფაილიდან რაიმე იფორმაცისს შემოტანა, (რაღაც რომ შემოგვაქვს)

// export არის როდესაც გაგვაქვს რაღაც ფაილიდან სხვა ფაილში (გატანა)

// იმპორსტადა ექსპორტს შორის განსხვავება ისაა რომ ერთს შემოაქვს მეორეს გააქვს.
