const p1 = document.getElementById('p-1'); // ელემენტის წამოღება ხდება ელემენტზე დარქმეული აიდის მეშვეობით წამოღება ჯავასკრიპტიდან
const p2 = document.getElementsByClassName('p-2'); // ელემენტის წამოღება ხდება ელემენტზე დარქმეული კლასის მეშვეობით წამოღება ჯავასკრიპტიდან კლასებით წამოსაღებად გამოგვადგება ბევრი ელემენტის წამოსაღებად
const p3 = document.getElementsByTagName('p'); // ელემენტის წამოღება ხდება კონკრეტული თეგის სახელით ჯავასკრიპტიდან მოაქვს იმდენი ელემენტი რამდენიც არსებობს HTML-ში

// 2

const button = document.getElementById('btn');
const divBox = document.getElementById('div');

button.addEventListener('click', function () {
  divBox.innerHTML += '<h1>Hello</h1>'; // innerHTML ამ ფუნქციის საშვალებით ჩვენ შეგვიძლია ახალი თეგი ჩავამატოთ HTML-ში მას და შევცვალოთ შეცვლის შემთხვევაში ყველა ემენეტი იშლება და ემატება ჩვენს მიერ დამატებული ემენეტი მშობელს ხედავს შიგთავისთ მასში არსებული შვილს ხედავს თეგიან შიგთვსიანად
  // textContent ამ ფუნქცის საშვალებით ჩვენ მხოლოდ თექსტის ჩასმა და შეცვლა შეგვიძლია არა ის რომ ჩვენ მასში ჩავსვათ ახალი თეგი
});
