const mathFunction = require('./math.utils');
const stringMethods = require('./string.methods');

console.log(mathFunction.addition(5, 5));
console.log(mathFunction.subtraction(10, 5));
console.log(mathFunction.multiplication(8, 2));
console.log(mathFunction.division(100, 2));

console.log(stringMethods.firstUpperString('merabi'));
console.log(stringMethods.reverseString('lika'));
console.log(stringMethods.upperCaseString('luka'));
console.log(stringMethods.toLowerCaseString('biks'));

// npm - რო განვავროცოთ არის (Node Package Manager)
// npm - არის სპეციალურად JavaScript, Node.js - ისთვის
// მასზე ინახება უამრამი მზა კოდები ბიბლოთეკები, პაკეტები რომელბსაც პროგრამისტები ქმნიან და მასზე ავთავსებენ შემდგომ მისი გამოყენება ნებისმიერ ადამიანს შეუძლია.
// მაგალითად საიტზე აკეთებ რაიმე ანიმაციებს სტაილის მეშვეობით ჩვენნ რომ ხელით არ ვწეროთ ყველაფერი 0-დან ვდგებით შევდივართ ვირჩევთ სასურველ ანიმაციის ბიბლიოთეკას და ტერმინალში ვწერთ (npm install animation.css) - ჩვენს მიერ შერჩეული ბიბლიოთეკა ჩამოიწერება და ხელით 0_დან წერის მაგივრად ის უკვე ჩვენს ფოლდერში იქნება.

// საიდან ჩნდება ჩვენს კომპიუტერში npm საიდან და როდესაც ჩვენ ჩამოვწერთ Node.js ავტომატურად მოყვება npm მას და ის უკვე გვეხმარება ბიბლიოთეკების ჩამოტვირთვაშიდა მართვაში.
// Node.js - გვეხმარება JavaSript გავუშვათ ბრაუზერის გარეშე ანუ ჩვენივე კომპიუტერში.

// მოკლედ როდესაც ადამიანი კომპიუტერში ჩამოწერს Node.js -ს მას ავტომატურად მოყვება npm.

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// Package.json - მას შეგვიძლია ვუწოდოთ პროქტების პასპორტი😂
// ის არის ერთი ფაილი რომელიც ინახავს პროქტებზე ინფორმაციებს
// რა წერია ამ ფაილში?
// project - პროექტის სახელი, version - ვერსია მაგ: (2.2.0), description - აღწერა რას აკეთებს ჩვენი პროქტი, არწერს ყველაფერს, dependencies - ყველა ის პაკეტები რაც სჭირდება ჩვენს პროქტს.
// რაში ვიყენებთ საერთოდ ჩვენ package.json-ს? იმისათვის რომ სხვამ გაიგოს თუ რა არის და რას იყენებს ჩვენი პროექტი
// ის გვეხმარება პაკეტების მართვისთვის მაგ: თუ ჩვენ გვჭირდება ბევრი ბიბლიოთეკა მაგ ფაილში ინახება ყველა ბიბლიოთეკის სია, მაგ: სხვას თუ მივეცით ჩვენი პროქტი მას არ მოუწევს ბიბლიოთეკების დაყენება ის უკვე ინახება package.json - ში უბრალოდ დავწერთ ტერმინალში (npm install) ავტოამტურად ჩამოტვირთავს მასში ყველა ბიბლიოთეკებს.
