import { myName, myAge, myCar } from './greet.js'; // იმპორტს გადავცემთ ობიექტის ფრჩხილებში თუ რა ფუნქცია შემოგვაქვს და შემდეგ საიდან ანუ რომელ ფაილიდან
import { weather } from './weather.js'; // შევქმენი მეორე ფაილი სადაც დავწერე ახალი ფუქცია ანალოგიურად შემოვიტანე ის ახალი ფაილი იმპორტის მეშვეობით

// ვიძახებთ ფუნქციებს და გადავცემთ მნიშვნელობებს

myName('merabi');
myName('luka');
myName('lika');

myAge(`ჩემი ასაკია ${20} წელი`);
myAge(`გილოცავ შენ ხარ ${21} წლის`);

myCar('BMW F36 430i');

weather(14);
