// hoisting ჯერ თუ ცვადი გამოვიძახეთ პრინტ ით შექმნამდე ის ავტომატურად კოდს ზედა თავში აიტანს და წამოადგენს როგორც ცარიელ ცვლადს let, const შექმნილ ცვლადების დროს გამოიტანს შეცდომას რომ ჩვენ იქამდე ვიძახებთ ცვლადს

console.log(firstName);
console.log(lastName);

let firstName = 'merabi';
const lastName = 'jqidze';

console.log(greet); // ჩვენ იქამდე გამივიძახეთ var ცვლადი სანამ შეიქმნებოდა მაგრამ აქ გამოგვიტანს undefind ვთქვათ რომ ამ დროს იქმნდება ესეთი რამ var greet;

var greet = 'hello world'; // ზემოთ გამოვიძახეთ მაგრამ გამოძახების შემდეგ შევქმენით

// 2

// let თუ ჩვენ ამ სტილის ცვლადს შევქმნით და მის შექმნამდე გამოვიძაბეთ ამ კონკრეტულ ცვლადს გამოგვიტანს შეცდომას ესეთი სახით undefind
// const კონსტის დროსაც იგივე რაინად იქნება თუ ჩვენ მის შექმნამდე გამოვიძახებთ არარსებულ ცვლადს ის გამოგვიტანს შეცდომას რომ ეს ცვლადები არ არსებობს და იქამდე იძახებთ მათს
// var ვარის შეთხვევაში არ გამოგვიტანს შეცდომას ის უბრალოდ გვეტყვის რომ ის ცვლადი ცარიელია და მას არ აქვს მნიშვნელობა თუ ჩვენ მას შექმნამდე გამოვიძახებთ

// 3

// function declaration როდესაც ჩვეულებრივ ფუნქციას ვქმნით და ვანიჭებთ სახელს მაგ:

function greet() {
  console.log('Hello World');
}

// function expression როდესაც ჩვენ მას ცვლადში ვინახავთ ფუნქციას და ცვლადის სახელითვე  ვიძახებთ მაგ:

let greets = function () {
  console.log('Hello World');
};

greets();
