// What is React - რეაქთი არის Javascript-ის ბიბლიოთეკა, რომელასაც გამოვიყენებთ ვებ გვერდების ინტერფეისის შესაქმნელად.
// მისი მთავარი პლიუსია შევქმნათ ვებ-გვერდი პატარა პატარა კომპონენტებად
// ანუ როდესაც დიდი საიტის აწყობას ვიწყებთ მის აწყობას ვიწყებთ პატარა დეტალებად ანუ იგივე რაც: (კომპონენტებად) და შემდგ ვკრავთ ერთიანად როგორც მაგალითად ლეგოს პატარა კუბიკებით ვაშენებთ.

// რა არის react-ში კომპონენტი:
// კომპონენტი არის ხელახლა გამოსაყენებელი კოდის ნაწილები რომელიც რაღაც კონკრეტყლ ელემენტს ან ფუნქციონას აგვიღწერს.

// კომპონენტები მაგ:
// header კომპონენტი - საიტის მთავარი ზედა ნაწილი (ლოგო, მენიუ, ჰიპერ-ლინკები და ასე შემდეგ...)
// main კომპონენტი - საიტის შუა ნაწილი საიტის მთავარი კონკენტი
// footer კომპონენტი - საიტის ქვედა ნაილი
// button კომპონენტი - ღოლაკი სადაცე შეიძლება ბევრგან გამოვიყენოთ
// მომპონენტი არის JavaSctipt-ფუნქციაა რომელიც აბრუნებს JSX-ს  (HTML-ს მსგავსი სინტაქსით)

// რა არის JSX
// JSX-ნისნავს (JavaScript XML)
// ესარის HTML-მსგავსი სინტაქსი რომელსაც JavaScript-ში ვწერთ, JSX გვიადბილებს კოდის წერას
// JSX-არის HTML-ის სტილის და JavaScript-ის ერთიანობა

// React-ი არის ბიბლიოთეკა UI-ასაწყობად
// komponent- ხელახლა გამოსაყენებელი კოდის ნაწილები (ლეგოს კუბიკების მსგავსად.)
// JSX -> HTML-ის მსგავსი სინტაქსი, რომელითაც ვწერთ ელემენტებს React-ში
// JSX (JavaScript Sintax Extencion)
