import Parent from './Parent';
import Child from './Child';
import Header from './Header';
import './App.css';

function App() {
  const handleClick = () => {
    alert('succesfull props drilling.');
  };

  const isLoggedIn = true;

  return (
    <>
      <Parent handleClick={handleClick} />
      <Header isLoggedIn={isLoggedIn} />
    </>
  );
}

export default App;

// props drilling - როდესაც გვინდა რომ მშობელ კომპონენტმა გვინდა გადასცეს ინფორმაცია ბოლო შვილ კომპონენტს
// მაგ: თუ ბოლო ელემენტამდე გვინდა მიაღწიოს ინფორმაციამ შეიძლება ინფორმაციამ გაიაროს ბევრ კომპონენტებს შორის ანუ შუამავლობა მოუწიოს კომპონენტებს
// მაგდროს ხდება ჯაჭვური გადაცემა სხვა კომპონენტები ხდება შუამავლები იმისათვის რომ საბოლოო კომპონენტამდე მივიდეს ინფორმაცია ამ შუამავალ კომპონენტებს არ სჭრიდებათ გადმოცემული ინფორმაცია უბრალოდ მათ შორის გაივლის
// მშობელი კომპონენტი გადასცემს მეორე კომპონენტს მეორე კომპონენტი მესამე კომპონენტს მესამე კომპონენტი მეთხე კომპონენტს და საბოლოოთ მივა ბოლო კომპონენტამდე ინფორმაცია

// უარყოფითი მხარეეები ისარის რომ უაზროდ გადადის კომპონენტიდან კომპონენტზე ინფორმაცია სისწრაფეც ნაკლებიაქვს, შუამავალი კომპონენტებს სულარ სჭირდებათ გადაცემული ინფორმაცია რამეში უბრალოდ თუარ მოხდა შუამავლოდა ისე ვერც მივა საბოლოო კომპონენტამდე
// დადებითი ისიქნება რომ მშობელი კომპონენტი გადაააწოდებს შვილობილ კომპონენტებს იფორმაციას
