// findinex - გამოიყენება მასივსი კონკრეტული ელემენტის ინდექსის გასაგებად მაგრამ თუ მსგავსი არის ის დააბრუნებს პირველივე შემხვედრს არაფლის შემთხვევაში აბრუნებს -1-ს

let numbers = [10, 15, 20, 25, 30]; // შექვმენი რიცხვების მასივი

let checkNumbers = numbers.findIndex((num) => num > 20); // შემდეგ findindex- მეთოდის მეშვეობით გამოვიტან იმ ელემენტის ინდექს რომელიც იმყოფება მასივში რომელიც არის 20-ზე მეტი მაგრამ ის გამოგვიტანს პორვეველივე შემხვედრს

console.log(checkNumbers); // დაგვიბრუნა იმ ელემენტის ინდექი რომელიც არის 20-ზე მეტი
