#homework - 1

#control flow - არის კოდის მიმდინარეობის მუშაობების პრინციპი ის შედგება სამ ნაწილისგან (sequencing, iteration, selection)
#sequencing - ეს არის თანმიმდევრობა ანუ კოდის თანმიმდევრობით შესრულება ზემოდან ქვემოთ ასევე წაკითხვა. 
#iteration - ეს არის იტერაცია ანუ პროგრამის განმეორება მრავალჯერ ციკლის საშვალებით (for loop, while loop) - ამის საშვალებით მოხდება იტერაცია ანუ პროგრამის მრავალჯერ განმეორება.
#selection - ეს არის არჩევანი ანუ გადაწყვეტილება პირობის მიხედვით მაგალითად გარეთ არის მზიანი ამინდი მოდი დღეს ჩავიცვათ შორტი, ან პირიქით დღეს არის წვიმიანი დღე მოდი დღეს ჩავიცვათ ქურთუკი. ანუ სელექშენი ნიშნავს პირობიდან გამომდინარე არჩევნის გაკეთება გადაწყვეტილების მიღება (if, elif, else)- საშვალებით.

#homework - 2

#iteration - ეს არის პროგრამის გამეორება მრავალჯერ იტერაცია ანუ ციკლის საშვალებით მოვახდენთ პროგრამის მრავალჯერ განმეორებას (for loop, while loop)-საშვალებით

#1. for loop - ეს არის ციკლი რომლითად შეგვიძლია კოდი განვამეოროთ რამდენიმეჯერ მაგრამ ეს ციკლი გამოიყენება მაშინ როდესაც ვიცით თუ რამდენჯერ უნდა განმეორდეს პროგრამა ამას ჩვენ ვერ გამოვიყენეთ თუ არ ვიცით რამდენჯერ უნდა განმეორდეს პროგრამა მხოლოდ მაშინ როდესაც ვიცით განმეორების რაოდენობა

#მაგ: 1
for i in range(3): #აქ ვიციტ რომ სამჯერ გაგვიბეჭდავს hello world აქ ზუსტად ვიცოდიტ რომ სამჯერ გაბივებჭდავდა.
    print("hello worl")

#2. while loop - ეს არის ციკლი იგივე მაგრამ განსხვავება ისარის რომ ამას იმ შემთხვევაში ვიყენებთ როდესაც არ ვიციტ თუ რამდენჯერ უნდა განმეორდეს კოდის როდესაც არ ვიცით რამდენჯერ უნდა გამოერდეს.

#მაგ: 2

password = "example123"

user_input = 0

while user_input != password: #ამ პროგრამის მაგალითზე მომხმარებელმა უნდა შემოიტანოს სწორი პაროლი და სანამ სწორ პაროლს არ შემოიტანს იქამდე მოსთხოვს პაროლის შემოტანას (while loop)- გამოვიყენებტ როდესაც არ ვიცით თუ რამდენჯერ უნდა განმეორდეს პროგრამა ჩვენ ხო არ ვიცით მომხმარებელს პაროლი რამდენჯერ შეეშლება ან რამდენჯერ უნდა ვუთხრათ შემოიტანოს პაროლი ამიტომ გამოვიყენებთ ამ ციკლს.
    user_input = input("Enter your password: ")

print("You have successfully logged in.")


#homework - 3

sum1 = 0

for i in range(1, 10):
    sum1 += i

print(sum1)

#homework - 4

sum2 = 0

num = 1

while num < 10:
    sum2 += num
    num += 1

print(sum2)

#homework - 5

for i in range(2, 21):
    if i % 2 == 0:
        print(i)


#homework - 6 

num2 = 31

while num2 < 70:
    print(num2)
    num2 += 2

#homework - 7

#index - ეს არის სტრინგისა და რიცხვების მისამართი ისინი არიან დანომრილი რომ თითოეულ ასოს და რიცხვს მივწვდეთ თავისი მისამართის მიხედვით ინდექსი თვლა იწყება 0-დან მაგ: 0,2,3,4 და შეგვიძლია მარჯვნიდან მარცხნივ დათვლა -1,-2,-3 და ასე შემდეგ ისენქსის მიხედვით ჩვენ შეგვიძლია სტრინგიდან მხოლოდ ერთ სიმბოლოს მივწვდეთ და გამოვიტანოთ ანუ ინდექსის საშვალებით ვწვდებით ელემენტებს.
#index  0 1 2 3 4 5
name = "p y t h o n"
#index 6- 5- 4- 3- 2- 1-
print(name[0]) #პრინტში ვიძახებთ ცვლადს და ვუწერთ გვერდით კვადრატულ ფრჩხილს შემდეგ იმ კონკრეტულ სიმბოლოს მისამართს რომელსაც გვინდა მივწვდეთ ამ შემთხვევაში [0]- ვწვდებით p-სიმბოლოს და ასე შემდეგ.
print(name[1]) # [1]-y
print(name[2]) #[2]-t
print(name[3]) #[3]-h
print(name[4]) #[4]-o
print(name[5]) #[5]-n


#homework - 8

numbers = int(input("Enter numbers: "))

count = 0

for i in range(2, (numbers // 2) + 1):
    if numbers % i == 0:
        count += 1

if count == 0:
    print("Number is prime.")

else:
    print("Number is not prime.")


#homework - 9

numbers2 = int(input("Enter numbers: "))

sum3 = 0

for i in range(1, numbers2 + 1):
    sum3 += i

print(sum3)


#homework - 10

#flow chart - არის ალგორითმი რომელიც წარმოადგენს პირობის სქმემას მის თანმიმდევრობას თუ როგორ მიმდინაორეობს პირობა სქემის სახით.

#მაგ:
age = 14 #მომხმარებელი არის 14 წლის

is_student = False #მომხმარებელი არ არის სტუდენტი

if age < 18: #პირობაში პირობის შესრულება თუ მომხმარებელი არის 14 წლის ანუ არის 18 წელზე ნაკლები
    if is_student: #თუ ის არარის სტუდენტი მას ექნება 10% დასდაკლება
        print("10% discount")

    else: #თუ ის არ არის სტუდენტი მას ექნება 20% ფასდაკლება
        print("20% discount")
else: #თუ ის იქნება 18 წელზე ზევით მას ექნება რეგულარული ფასი
    print("Regular price")

#ამ მაგალითით არის მოყვანილი Flow chart - სქემა თუ როგორ პრინციპით იმუშავებს და როგორ თანმიმდევორობით პირობა.


#homework - 11

print("Sololearn - შესრულებულია.")
    

